# Pandas

# Pandas ==>It is an open source library that is used for handle data manipulations

In [1]:
#Data structure:
#      (1).Series  (2).DataFrame

In [2]:
import pandas as pd

In [3]:
a=pd.Series([1,29,3,4])
a

0     1
1    29
2     3
3     4
dtype: int64

In [5]:
type(a)

pandas.core.series.Series

# (2).DataFrame

In [6]:
a={
    "Emp_ID" : [1,2,3,4,5,6,7,8],
    "Name" :['sam','ram','rahul','avneet','ankit','divyanshu','ajay','tushar'],
    "Department" :['IT','HR','HR','IT','OPERATIONS','IT','HR','IT'],
    "Working_hours" : [8,9,9,9,8,7,8,9]
}

In [7]:
type(a)

dict

In [8]:
df=pd.DataFrame(a)
df

   Emp_ID       Name  Department  Working_hours
0       1        sam          IT              8
1       2        ram          HR              9
2       3      rahul          HR              9
3       4     avneet          IT              9
4       5      ankit  OPERATIONS              8
5       6  divyanshu          IT              7
6       7       ajay          HR              8
7       8     tushar          IT              9

In [9]:
df.columns

Index(['Emp_ID', 'Name', 'Department', 'Working_hours'], dtype='object')

In [10]:
df.head() ### It returns top 5 data by deafault

   Emp_ID    Name  Department  Working_hours
0       1     sam          IT              8
1       2     ram          HR              9
2       3   rahul          HR              9
3       4  avneet          IT              9
4       5   ankit  OPERATIONS              8

In [11]:
df.head(2)

   Emp_ID Name Department  Working_hours
0       1  sam         IT              8
1       2  ram         HR              9

In [12]:
df.head(6)

   Emp_ID       Name  Department  Working_hours
0       1        sam          IT              8
1       2        ram          HR              9
2       3      rahul          HR              9
3       4     avneet          IT              9
4       5      ankit  OPERATIONS              8
5       6  divyanshu          IT              7

In [13]:
df.tail() ###It returns bottom 5 data by default

   Emp_ID       Name  Department  Working_hours
3       4     avneet          IT              9
4       5      ankit  OPERATIONS              8
5       6  divyanshu          IT              7
6       7       ajay          HR              8
7       8     tushar          IT              9

In [14]:
df.tail(2)

   Emp_ID    Name Department  Working_hours
6       7    ajay         HR              8
7       8  tushar         IT              9

In [16]:
df.sample() ###It returns random-indexed rows.

   Emp_ID       Name Department  Working_hours
5       6  divyanshu         IT              7

In [17]:
df.describe() ## It returns statically view of data.

        Emp_ID  Working_hours
count  8.00000       8.000000
mean   4.50000       8.375000
std    2.44949       0.744024
min    1.00000       7.000000
25%    2.75000       8.000000
50%    4.50000       8.500000
75%    6.25000       9.000000
max    8.00000       9.000000

In [18]:
df.info() ## complete overview of data.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Emp_ID         8 non-null      int64
 1   Name           8 non-null      object
 2   Department     8 non-null      object
 3   Working_hours  8 non-null      int64
dtypes: int64(2), object(2)
memory usage: 384.0+ bytes

In [25]:
## to export your data in csv format
df.to_csv("C:\\Users\\RAHUL CHOUDHARY\\Summer inter regex\\ML Regex\\Emp_Info1.csv")

In [22]:
df.to_csv("C:\\Users\\RAHUL CHOUDHARY\\Summer inter regex\\ML Regex\\Emp_Info2.csv", index =False) ##index is used to remove unwanted colum.

In [23]:
df.to_excel("C:\\Users\\RAHUL CHOUDHARY\\Summer inter regex\\ML Regex\\Old_Emp_Info.xlsx")

# How to read csv file into jupyter notebook

In [27]:
df =pd.read_csv("C:\\Users\\RAHUL CHOUDHARY\\Summer inter regex\\ML Regex\\Emp_Info1.csv")

In [28]:
df.head()

   Unnamed: 0  Emp_ID    Name  Department  Working_hours
0           0       1     sam          IT              8
1           1       2     ram          HR              9
2           2       3   rahul          HR              9
3           3       4  avneet          IT              9
4           4       5   ankit  OPERATIONS              8

In [32]:
df['Department'].value_counts()

IT            4
HR            3
OPERATIONS    1
Name: Department, dtype: int64

In [31]:
df['Name'][0]

'sam'

In [33]:
df['Name'][0] = 'krit'

C:\Users\RAHUL CHOUDHARY\AppData\Local\Temp\ipykernel_5072\115391819.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0] = 'krit'

In [35]:
df.head()

   Unnamed: 0  Emp_ID    Name  Department  Working_hours
0           0       1    krit          IT              8
1           1       2     ram          HR              9
2           2       3   rahul          HR              9
3           3       4  avneet          IT              9
4           4       5   ankit  OPERATIONS              8

In [36]:
df['Working_hours'][3] =10

C:\Users\RAHUL CHOUDHARY\AppData\Local\Temp\ipykernel_5072\2432184776.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Working_hours'][3] =10

In [37]:
df.head()

   Unnamed: 0  Emp_ID    Name  Department  Working_hours
0           0       1    krit          IT              8
1           1       2     ram          HR              9
2           2       3   rahul          HR              9
3           3       4  avneet          IT             10
4           4       5   ankit  OPERATIONS              8

In [38]:
# loc and iloc

#df.loc["row_range","column_range"]
#df.iloc["row_range",column_range]

In [42]:
df.loc[2:5, ["Name", "Department"]] #slicing me ye last value bi include krta hai

        Name  Department
2      rahul          HR
3     avneet          IT
4      ankit  OPERATIONS
5  divyanshu          IT

In [46]:
df.iloc[3:5 , 1:2] #slicing me ye last value include nhi krta

   Emp_ID
3       4
4       5

In [47]:
df['Name'][2]= None

C:\Users\RAHUL CHOUDHARY\AppData\Local\Temp\ipykernel_5072\426300027.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2]= None

In [48]:
df

   Unnamed: 0  Emp_ID       Name  Department  Working_hours
0           0       1       krit          IT              8
1           1       2        ram          HR              9
2           2       3       None          HR              9
3           3       4     avneet          IT             10
4           4       5      ankit  OPERATIONS              8
5           5       6  divyanshu          IT              7
6           6       7       ajay          HR              8
7           7       8     tushar          IT              9

In [49]:
df['Department'][3]= None
df['Department'][4]= None

C:\Users\RAHUL CHOUDHARY\AppData\Local\Temp\ipykernel_5072\3747075890.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][3]= None
C:\Users\RAHUL CHOUDHARY\AppData\Local\Temp\ipykernel_5072\3747075890.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][4]= None

In [50]:
df

   Unnamed: 0  Emp_ID       Name Department  Working_hours
0           0       1       krit         IT              8
1           1       2        ram         HR              9
2           2       3       None         HR              9
3           3       4     avneet       None             10
4           4       5      ankit       None              8
5           5       6  divyanshu         IT              7
6           6       7       ajay         HR              8
7           7       8     tushar         IT              9

In [51]:
df.isnull() ## it will return true if you have missing values otherwise return false for other values

   Unnamed: 0  Emp_ID   Name  Department  Working_hours
0       False   False  False       False          False
1       False   False  False       False          False
2       False   False   True       False          False
3       False   False  False        True          False
4       False   False  False        True          False
5       False   False  False       False          False
6       False   False  False       False          False
7       False   False  False       False          False

In [52]:
df.isnull().sum() ##give toatl sum of null values in our dataframe

Unnamed: 0       0
Emp_ID           0
Name             1
Department       2
Working_hours    0
dtype: int64

In [53]:
df=df.dropna() # it will drop all the null values.

In [54]:
df

   Unnamed: 0  Emp_ID       Name Department  Working_hours
0           0       1       krit         IT              8
1           1       2        ram         HR              9
5           5       6  divyanshu         IT              7
6           6       7       ajay         HR              8
7           7       8     tushar         IT              9